#include <bits/stdc++.h>

using  namespace std;

int n,m;
struct tetromino{
    pair<int, int> p[4];
};

tetromino tetrominos[19]={
    {{{0,0}, {0,1}, {0,2}, {0,3}}},//tetrominos[0]의 형태 = 일자
    {{{0,0}, {1,0}, {2,0}, {3,0}}},//일자 회전한 거
    {{{0,0},{0,1},{1,0},{1,1}}}, //tetromnios[2] = 정사각형
    {{{0,0},{1,0},{2,0},{2,1}}}, //ㄴ자 폴리오미노 기본
    {{{0,0},{1,0},{0,1},{0,2}}}, //시계방향 회전1
    {{{0,0},{0,1},{1,1},{2,1}}}, //시계방향 회전2
    {{{0,0},{0,1},{0,2},{-1,2}}}, //시계방향 회전3
    {{{0,0},{1,0},{2,0},{2,-1}}}, //대칭 - 기본
    {{{0,0},{1,0},{1,1},{1,2}}}, //시계방향 회전1
    {{{0,0},{0,1},{1,0},{2,0}}}, //시계방향 회전2
    {{{0,0},{0,1},{0,2},{1,2}}}, //시계방향 회전3
    {{{0,0},{1,0},{1,1},{2,1}}}, //ㄹ자 폴리오미노 기본
    {{{0,0},{0,1},{-1,1},{-1,2}}}, //시계방향 회전 1
    {{{0,0},{1,0},{1,-1},{2,-1}}}, //대칭 - 기본
    {{{0,0},{0,1},{1,1},{1,2}}}, //시계방향 회전 1
    {{{0,0},{0,1},{0,2},{1,1}}}, //ㅜ자 폴리오미노 기본
    {{{0,0},{1,0},{2,0},{1,-1}}}, //시계방향 회전 1
    {{{0,0},{0,1},{0,2},{-1,1}}}, //시계방향 회전 2
    {{{0,0},{1,0},{2,0},{1,1}}}//시계방향 회전 3
};

int field[501][501];

int maxSum=0;

int main(){
    ios::sync_with_stdio(0);
    cin.tie(0);

    //입력
    cin>>n>>m;

    for(int i=1;i<=n;i++){
        for(int j=1;j<=m;j++){
            cin>>field[i][j];
        }
    }

    //먼저 테트로미노 중 하나를 골라
    for(auto i : tetrominos){
        //고른 놈을 field에서 차례롤 놓을거야.
        for(int j=1;j<=n;j++){
            for (int k=1;k<=m;k++){
                int sum=0;
                //j,k위치에 놓는다.
                //우선 놓을 수 있는지 체크
                //j,k + i.p[0~3].first, i.p[0~3].second
                bool check = true;
                for(int l=0;l<=3;l++){
                    if(j+i.p[l].first>=1 && j+i.p[l].first<=n && k+i.p[l].second>=1 && k+i.p[l].second<=m){
                        sum+=field[j+i.p[l].first][k+i.p[l].second];
                        continue;
                    }
                    else{
                        check = false;
                        break;
                    }
                }
                if(!check) continue;

                //여기까지 왔다면, 놓을 수는 있는거야.
                if(sum>=maxSum) maxSum = sum;
            }
        }
    }

    cout<<maxSum;
}